In [1]:
''' PANDAS '''
import pandas as pd

In [2]:
''' sqlite3 '''
# Import sqlite3
import sqlite3

# Create connection. This will create the connection with a database. 
# If the database does not exist it will create the database
conn = sqlite3.connect('weatherdata.db')

In [3]:
# Create cursor
cur = conn.cursor()

# Empty the database table to start with
cur.execute('DROP TABLE IF EXISTS WeatherTable')

# Get the csv data into a dataframe
df = pd.read_csv('WeatherData.csv', header=0)
df.head()

     City         Country  Season  Temperature  Rainfall
0  Mumbai           India       1         24.8       5.9
1  Mumbai           India       2         28.4      16.2
2  Mumbai           India       3         27.9     549.4
3  Mumbai           India       4         27.6     346.0
4  London  United Kingdom       1          4.2     207.7

In [4]:
# WRITE the df into a table of the database
'''By default, if a table does not already exists and you try the code below, 
a new table will be created in your database with the name you specified,
do not create a column with the index'''
df.to_sql('WeatherTable', con=conn, if_exists='append', index=False)

In [5]:
print("Whole table, no conditions")
cur.execute('SELECT * FROM WeatherTable')
cur.fetchall()

Whole table, no conditions

[('Mumbai', 'India', 1, 24.8, 5.9),
 ('Mumbai', 'India', 2, 28.4, 16.2),
 ('Mumbai', 'India', 3, 27.9, 549.4),
 ('Mumbai', 'India', 4, 27.6, 346.0),
 ('London', 'United Kingdom', 1, 4.2, 207.7),
 ('London', 'United Kingdom', 2, 8.3, 169.6),
 ('London', 'United Kingdom', 3, 15.7, 157.0),
 ('London', 'United Kingdom', 4, 10.4, 218.5),
 ('Cairo', 'Egypt', 1, 13.6, 16.5),
 ('Cairo', 'Egypt', 2, 20.7, 6.5),
 ('Cairo', 'Egypt', 3, 27.7, 0.1),
 ('Cairo', 'Egypt', 4, 22.2, 4.5),
 ('Sydney', 'Australia', 1, 12.77, 60.8),
 ('Sydney', 'Australia', 2, 16.67, 80.75),
 ('Sydney', 'Australia', 3, 23.88, 120.6),
 ('Sydney', 'Australia', 4, 18.89, 90.9)]

In [10]:
#A
print("All the records of the city of London.")
cur.execute('SELECT * FROM WeatherTable WHERE City = "London"')
cur.fetchall()

All the records of the city of London.

[('London', 'United Kingdom', 1, 4.2, 207.7),
 ('London', 'United Kingdom', 2, 8.3, 169.6),
 ('London', 'United Kingdom', 3, 15.7, 157.0),
 ('London', 'United Kingdom', 4, 10.4, 218.5)]

In [11]:
#B
print("All summer records")
cur.execute('SELECT * FROM WeatherTable WHERE Season = 3')
cur.fetchall()

All summer records

[('Mumbai', 'India', 3, 27.9, 549.4),
 ('London', 'United Kingdom', 3, 15.7, 157.0),
 ('Cairo', 'Egypt', 3, 27.7, 0.1),
 ('Sydney', 'Australia', 3, 23.88, 120.6)]

In [7]:
#C
print("City, country, and season for which the average temperature is less than 20 degrees.")
cur.execute('SELECT City, Country, Season, Temperature FROM WeatherTable WHERE Temperature < 20 ')
cur.fetchall()

City, country, and season for which the average temperature is less than 20 degrees.

[('London', 'United Kingdom', 1, 4.2),
 ('London', 'United Kingdom', 2, 8.3),
 ('London', 'United Kingdom', 3, 15.7),
 ('London', 'United Kingdom', 4, 10.4),
 ('Cairo', 'Egypt', 1, 13.6),
 ('Sydney', 'Australia', 1, 12.77),
 ('Sydney', 'Australia', 2, 16.67),
 ('Sydney', 'Australia', 4, 18.89)]

In [19]:
#D
print("City, country, and season for which the average temperature is greater than 20 degrees and the total rainfall is less than 10mm.")
cur.execute('SELECT * FROM WeatherTable WHERE (Temperature > 20 AND Rainfall < 10)')
cur.fetchall()

City, country, and season for which the average temperature is greater than 20 degrees and the total rainfall is less than 10mm.

[('Mumbai', 'India', 1, 24.8, 5.9),
 ('Cairo', 'Egypt', 2, 20.7, 6.5),
 ('Cairo', 'Egypt', 3, 27.7, 0.1),
 ('Cairo', 'Egypt', 4, 22.2, 4.5)]

In [21]:
#E
cur.execute('SELECT MAX(Rainfall) FROM WeatherTable')
cur.fetchall()

[(549.4,)]

In [8]:
#F
print("City, season, and rainfall amounts for all records in descending order of rainfall.")
cur.execute('SELECT City, Season, Rainfall FROM WeatherTable ORDER BY Rainfall DESC')
cur.fetchall()

City, season, and rainfall amounts for all records in descending order of rainfall.

[('Mumbai', 3, 549.4),
 ('Mumbai', 4, 346.0),
 ('London', 4, 218.5),
 ('London', 1, 207.7),
 ('London', 2, 169.6),
 ('London', 3, 157.0),
 ('Sydney', 3, 120.6),
 ('Sydney', 4, 90.9),
 ('Sydney', 2, 80.75),
 ('Sydney', 1, 60.8),
 ('Cairo', 1, 16.5),
 ('Mumbai', 2, 16.2),
 ('Cairo', 2, 6.5),
 ('Mumbai', 1, 5.9),
 ('Cairo', 4, 4.5),
 ('Cairo', 3, 0.1)]

In [9]:
#G
cur.execute('SELECT City, SUM(Rainfall) FROM WeatherTable WHERE City = "Cairo"')
cur.fetchall()

[('Cairo', 27.6)]

In [10]:
#H
cur.execute('SELECT City, SUM(Rainfall) FROM WeatherTable GROUP BY City')
cur.fetchall()

[('Cairo', 27.6),
 ('London', 752.8),
 ('Mumbai', 917.5),
 ('Sydney', 353.04999999999995)]

In [50]:
# Close the Database connection
conn.close()